gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/camera.c
/**
 * @file camera.c
 * @author Gian Barta-Dougall
 * @brief
 * @version 0.1
 * @date 2022-12-19
 *
 * @copyright Copyright (c) 2022
 *
 */

/* Personal Includes */
#include "camera.h"
#include "sd_card.h"
#include "esp32_uart.h"
#include "utilities.h"
#include "ds18b20.h"
#include "datetime.h"

/* Private Macros */
#define BOARD_ESP32CAM_AITHINKER

// support IDF 5.x
#ifndef portTICK_RATE_MS
    #define portTICK_RATE_MS portTICK_PERIOD_MS
#endif

// ESP32Cam (AiThinker) PIN Map
#ifdef BOARD_ESP32CAM_AITHINKER

    #define CAM_PIN_PWDN  32
    #define CAM_PIN_RESET -1 // software reset will be performed
    #define CAM_PIN_XCLK  0
    #define CAM_PIN_SIOD  26
    #define CAM_PIN_SIOC  27

    #define CAM_PIN_D7    35
    #define CAM_PIN_D6    34
    #define CAM_PIN_D5    39
    #define CAM_PIN_D4    36
    #define CAM_PIN_D3    21
    #define CAM_PIN_D2    19
    #define CAM_PIN_D1    18
    #define CAM_PIN_D0    5
    #define CAM_PIN_VSYNC 25
    #define CAM_PIN_HREF  23
    #define CAM_PIN_PCLK  22

#endif

/* Private Variable Declarations */

static camera_config_t camera_config = {
    .pin_pwdn     = CAM_PIN_PWDN,
    .pin_reset    = CAM_PIN_RESET,
    .pin_xclk     = CAM_PIN_XCLK,
    .pin_sccb_sda = CAM_PIN_SIOD,
    .pin_sccb_scl = CAM_PIN_SIOC,

    .pin_d7    = CAM_PIN_D7,
    .pin_d6    = CAM_PIN_D6,
    .pin_d5    = CAM_PIN_D5,
    .pin_d4    = CAM_PIN_D4,
    .pin_d3    = CAM_PIN_D3,
    .pin_d2    = CAM_PIN_D2,
    .pin_d1    = CAM_PIN_D1,
    .pin_d0    = CAM_PIN_D0,
    .pin_vsync = CAM_PIN_VSYNC,
    .pin_href  = CAM_PIN_HREF,
    .pin_pclk  = CAM_PIN_PCLK,

    // XCLK 20MHz or 10MHz for OV2640 double FPS (Experimental)
    .xclk_freq_hz = 20000000,
    .ledc_timer   = LEDC_TIMER_0,
    .ledc_channel = LEDC_CHANNEL_0,

    .pixel_format = PIXFORMAT_JPEG, // YUV422,GRAYSCALE,RGB565,JPEG - This was the deafultPIXFORMAT_RGB565
    .frame_size =
        FRAMESIZE_UXGA, // QQVGA-UXGA, For ESP32, do not use sizes above QVGA when not JPEG. The performance of
                        // the ESP32-S series has improved a lot, but JPEG mode always gives better frame rates.

    .jpeg_quality = 8, // 0-63, for OV series camera sensors, lower number means higher quality
    .fb_count     = 1, // When jpeg mode is used, if fb_count more than one, the driver will work in continuous mode.
    .grab_mode    = CAMERA_GRAB_WHEN_EMPTY,
};

int cameraInitalised = 0;

/* Function Prototypes */
uint8_t camera_capture_image(camera_fb_t** image);

uint8_t camera_init(void) {

    // Initialize the camera
    if (esp_camera_init(&camera_config) != ESP_OK) {
        cameraInitalised = FALSE;
        return FALSE;
    }

    cameraInitalised = TRUE;
    return TRUE;
}

uint8_t camera_get_resolution(void) {
    return camera_config.frame_size;
}

uint8_t camera_set_resolution(uint8_t camRes) {

    // Deinitinalise camera so camera settings can be changed
    esp_camera_deinit();

    // Update camera resolution settings
    switch (camRes) {
        case FRAMESIZE_QVGA:
            camera_config.frame_size = FRAMESIZE_QVGA;
            break;
        case FRAMESIZE_CIF:
            camera_config.frame_size = FRAMESIZE_CIF;
            break;
        case FRAMESIZE_VGA:
            camera_config.frame_size = FRAMESIZE_VGA;
            break;
        case FRAMESIZE_SVGA:
            camera_config.frame_size = FRAMESIZE_SVGA;
            break;
        case FRAMESIZE_XGA:
            camera_config.frame_size = FRAMESIZE_XGA;
            break;
        case FRAMESIZE_SXGA:
            camera_config.frame_size = FRAMESIZE_SXGA;
            break;
        case FRAMESIZE_UXGA:
            camera_config.frame_size = FRAMESIZE_UXGA;
            break;
        default:
            // Should never get here, should only ever recieve one of the above cases
            return FALSE;
    }
    // Configure Camera
    sd_card_log(SYSTEM_LOG_FILE, "Reconfiguring Camera\0");
    if (camera_init() != TRUE) {
        return FALSE;
    }

    // Successfully changed the camera resolution
    return TRUE;
}

// uint8_t camera_send_data(uint8_t receiver, uint8_t sender, uint8_t request, uint8_t* data, uint32_t numBytesToSend) {
//     bpacket_buffer_t bpacketBuffer;
//     bpacket_t b1;
//     char j[50];

//     sprintf(j, "Entered camera send data function\r\n");
//     bpacket_create_sp(&b1, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
//                       j);
//     bpacket_to_buffer(&b1, &bpacketBuffer);
//     esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);

//     // Create the bpacket
//     bpacket_t bpacket;

//     if (bpacket_create_p(&bpacket, receiver, sender, request, BPACKET_CODE_IN_PROGRESS, 0, NULL) != TRUE) {
//         return FALSE;
//     }

//     // Set the number of bytes to the maximum
//     bpacket.numBytes = BPACKET_MAX_NUM_DATA_BYTES;

//     uint32_t bytesSent = 0;
//     uint32_t index     = 0;

//     sprintf(j, "Starting to send stream data\r\n");
//     bpacket_create_sp(&b1, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
//                       j);
//     bpacket_to_buffer(&b1, &bpacketBuffer);
//     esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);

//     while (bytesSent < numBytesToSend) {

//         if (index < BPACKET_MAX_NUM_DATA_BYTES) {
//             bpacket.bytes[index++] = data[bytesSent++];
//             continue;
//         }

//         // Send the bpacket
//         bpacket_to_buffer(&bpacket, &bpacketBuffer);
//         esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);

//         // Reset the index
//         index = 0;
//     }

//     sprintf(j, "Most data sent\r\n");
//     bpacket_create_sp(&b1, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
//                       j);
//     bpacket_to_buffer(&b1, &bpacketBuffer);
//     esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);

//     // Send the last bpacket
//     if (index != 0) {

//         // Update bpacket info
//         bpacket.numBytes = index;
//         bpacket.code     = BPACKET_CODE_SUCCESS;

//         // Send the bpacket
//         bpacket_to_buffer(&bpacket, &bpacketBuffer);
//         esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);
//     }

//     sprintf(j, "Completed\r\n");
//     bpacket_create_sp(&b1, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
//                       j);
//     bpacket_to_buffer(&b1, &bpacketBuffer);
//     esp32_uart_send_data(bpacketBuffer.buffer, bpacketBuffer.numBytes);

//     return TRUE;
// }

void camera_stream_image(bpacket_t* bpacket) {

    camera_fb_t* image = NULL;

    if (camera_capture_image(&image) != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "Camera could not taken photo\r\n\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Image was able to be taken. Send image back to sender
    if (bpacket_send_data(esp32_uart_send_data, bpacket->sender, bpacket->receiver, bpacket->request, image->buf,
                          image->len) != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "Failed to send image\r\n\0");
        esp32_uart_send_bpacket(bpacket);
    }

    // Free the image
    esp_camera_fb_return(image);
}

void camera_capture_and_save_image(bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Confirm camera has been initialised
    if (cameraInitalised != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Camera was unitailised\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Confirm the SD card can be mounted
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card could not open\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Take a photo
    sd_card_log(SYSTEM_LOG_FILE, "Taking image");
    camera_fb_t* pic = esp_camera_fb_get();

    // Return error if picture could not be taken
    if (pic == NULL) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Failed to take a photo\0");
        esp32_uart_send_bpacket(bpacket);
        sd_card_log(SYSTEM_LOG_FILE, "Camera failed to take image");
    } else if (sd_card_save_image(pic->buf, pic->len, bpacket) != TRUE) {
        sd_card_log(SYSTEM_LOG_FILE, "Image could not be saved");
    } else {
        char msg[100];
        sprintf(msg, "Image was %zu bytes", pic->len);
        sd_card_log(SYSTEM_LOG_FILE, msg);
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_SUCCESS, msg);
        esp32_uart_send_bpacket(bpacket);
    }

    esp_camera_fb_return(pic);

    sd_card_close();
}

uint8_t camera_capture_image(camera_fb_t** image) {

    *image = esp_camera_fb_get();

    if (*image == NULL) {
        esp_camera_fb_return(*image);
        return FALSE;
    }

    return TRUE;
}